codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk100.h
  .extern SBT13REG0        /* 0xBF8FB440 */
  .extern SBT13RD0         /* 0xBF8FB450 */
  .extern SBT13WR0         /* 0xBF8FB458 */
  .extern DEVCFG3          /* 0xBFC0FFC0 */
  .extern DEVCFG2          /* 0xBFC0FFC4 */
  .extern DEVCFG1          /* 0xBFC0FFC8 */
  .extern DEVCFG0          /* 0xBFC0FFCC */
  .extern DEVCP3           /* 0xBFC0FFD0 */
  .extern DEVCP2           /* 0xBFC0FFD4 */
  .extern DEVCP1           /* 0xBFC0FFD8 */
  .extern DEVCP0           /* 0xBFC0FFDC */
  .extern DEVSIGN3         /* 0xBFC0FFE0 */
  .extern DEVSIGN2         /* 0xBFC0FFE4 */
  .extern DEVSIGN1         /* 0xBFC0FFE8 */
  .extern DEVSIGN0         /* 0xBFC0FFEC */
  .extern SEQ3             /* 0xBFC0FFF0 */
  .extern SEQ2             /* 0xBFC0FFF4 */
  .extern SEQ1             /* 0xBFC0FFF8 */
  .extern SEQ0             /* 0xBFC0FFFC */
  .extern DEVSN0           /* 0xBFC54020 */
  .extern DEVSN1           /* 0xBFC54024 */
  .extern ADEVCFG3         /* 0xBFC0FF40 */
  .extern ADEVCFG2         /* 0xBFC0FF44 */
  .extern ADEVCFG1         /* 0xBFC0FF48 */
  .extern ADEVCFG0         /* 0xBFC0FF4C */
  .extern ADEVCP3          /* 0xBFC0FF50 */
  .extern ADEVCP2          /* 0xBFC0FF54 */
  .extern ADEVCP1          /* 0xBFC0FF58 */
  .extern ADEVCP0          /* 0xBFC0FF5C */
  .extern ADEVSIGN3        /* 0xBFC0FF60 */
  .extern ADEVSIGN2        /* 0xBFC0FF64 */
  .extern ADEVSIGN1        /* 0xBFC0FF68 */
  .extern ADEVSIGN0        /* 0xBFC0FF6C */
  .extern ASEQ3            /* 0xBFC0FF70 */
  .extern ASEQ2            /* 0xBFC0FF74 */
  .extern ASEQ1            /* 0xBFC0FF78 */
  .extern ASEQ0            /* 0xBFC0FF7C */
  .extern AUBADEVCFG3      /* 0xBFC2FF40 */
  .extern AUBADEVCFG2      /* 0xBFC2FF44 */
  .extern AUBADEVCFG1      /* 0xBFC2FF48 */
  .extern AUBADEVCFG0      /* 0xBFC2FF4C */
  .extern AUBADEVCP3       /* 0xBFC2FF50 */
  .extern AUBADEVCP2       /* 0xBFC2FF54 */
  .extern AUBADEVCP1       /* 0xBFC2FF58 */
  .extern AUBADEVCP0       /* 0xBFC2FF5C */
  .extern AUBADEVSIGN3     /* 0xBFC2FF60 */
  .extern AUBADEVSIGN2     /* 0xBFC2FF64 */
  .extern AUBADEVSIGN1     /* 0xBFC2FF68 */
  .extern AUBADEVSIGN0     /* 0xBFC2FF6C */
  .extern AUBASEQ3         /* 0xBFC2FF70 */
  .extern AUBASEQ2         /* 0xBFC2FF74 */
  .extern AUBASEQ1         /* 0xBFC2FF78 */
  .extern AUBASEQ0         /* 0xBFC2FF7C */
  .extern UBADEVCFG3       /* 0xBFC2FFC0 */
  .extern UBADEVCFG2       /* 0xBFC2FFC4 */
  .extern UBADEVCFG1       /* 0xBFC2FFC8 */
  .extern UBADEVCFG0       /* 0xBFC2FFCC */
  .extern UBADEVCP3        /* 0xBFC2FFD0 */
  .extern UBADEVCP2        /* 0xBFC2FFD4 */
  .extern UBADEVCP1        /* 0xBFC2FFD8 */
  .extern UBADEVCP0        /* 0xBFC2FFDC */
  .extern UBADEVSIGN3      /* 0xBFC2FFE0 */
  .extern UBADEVSIGN2      /* 0xBFC2FFE4 */
  .extern UBADEVSIGN1      /* 0xBFC2FFE8 */
  .extern UBADEVSIGN0      /* 0xBFC2FFEC */
  .extern UBASEQ3          /* 0xBFC2FFF0 */
  .extern UBASEQ2          /* 0xBFC2FFF4 */
  .extern UBASEQ1          /* 0xBFC2FFF8 */
  .extern UBASEQ0          /* 0xBFC2FFFC */
  .extern ABF1DEVCFG3      /* 0xBFC4FF40 */
  .extern ABF1DEVCFG2      /* 0xBFC4FF44 */
  .extern ABF1DEVCFG1      /* 0xBFC4FF48 */
  .extern ABF1DEVCFG0      /* 0xBFC4FF4C */
  .extern ABF1DEVCP3       /* 0xBFC4FF50 */
  .extern ABF1DEVCP2       /* 0xBFC4FF54 */
  .extern ABF1DEVCP1       /* 0xBFC4FF58 */
  .extern ABF1DEVCP0       /* 0xBFC4FF5C */
  .extern ABF1DEVSIGN3     /* 0xBFC4FF60 */
  .extern ABF1DEVSIGN2     /* 0xBFC4FF64 */
  .extern ABF1DEVSIGN1     /* 0xBFC4FF68 */
  .extern ABF1DEVSIGN0     /* 0xBFC4FF6C */
  .extern ABF1SEQ3         /* 0xBFC4FF70 */
  .extern ABF1SEQ2         /* 0xBFC4FF74 */
  .extern ABF1SEQ1         /* 0xBFC4FF78 */
  .extern ABF1SEQ0         /* 0xBFC4FF7C */
  .extern BF1DEVCFG3       /* 0xBFC4FFC0 */
  .extern BF1DEVCFG2       /* 0xBFC4FFC4 */
  .extern BF1DEVCFG1       /* 0xBFC4FFC8 */
  .extern BF1DEVCFG0       /* 0xBFC4FFCC */
  .extern BF1DEVCP3        /* 0xBFC4FFD0 */
  .extern BF1DEVCP2        /* 0xBFC4FFD4 */
  .extern BF1DEVCP1        /* 0xBFC4FFD8 */
  .extern BF1DEVCP0        /* 0xBFC4FFDC */
  .extern BF1DEVSIGN3      /* 0xBFC4FFE0 */
  .extern BF1DEVSIGN2      /* 0xBFC4FFE4 */
  .extern BF1DEVSIGN1      /* 0xBFC4FFE8 */
  .extern BF1DEVSIGN0      /* 0xBFC4FFEC */
  .extern BF1SEQ3          /* 0xBFC4FFF0 */
  .extern BF1SEQ2          /* 0xBFC4FFF4 */
  .extern BF1SEQ1          /* 0xBFC4FFF8 */
  .extern BF1SEQ0          /* 0xBFC4FFFC */
  .extern ABF2DEVCFG3      /* 0xBFC6FF40 */
  .extern ABF2DEVCFG2      /* 0xBFC6FF44 */
  .extern ABF2DEVCFG1      /* 0xBFC6FF48 */
  .extern ABF2DEVCFG0      /* 0xBFC6FF4C */
  .extern ABF2DEVCP3       /* 0xBFC6FF50 */
  .extern ABF2DEVCP2       /* 0xBFC6FF54 */
  .extern ABF2DEVCP1       /* 0xBFC6FF58 */
  .extern ABF2DEVCP0       /* 0xBFC6FF5C */
  .extern ABF2DEVSIGN3     /* 0xBFC6FF60 */
  .extern ABF2DEVSIGN2     /* 0xBFC6FF64 */
  .extern ABF2DEVSIGN1     /* 0xBFC6FF68 */
  .extern ABF2DEVSIGN0     /* 0xBFC6FF6C */
  .extern ABF2SEQ3         /* 0xBFC6FF70 */
  .extern ABF2SEQ2         /* 0xBFC6FF74 */
  .extern ABF2SEQ1         /* 0xBFC6FF78 */
  .extern ABF2SEQ0         /* 0xBFC6FF7C */
  .extern BF2DEVCFG3       /* 0xBFC6FFC0 */
  .extern BF2DEVCFG2       /* 0xBFC6FFC4 */
  .extern BF2DEVCFG1       /* 0xBFC6FFC8 */
  .extern BF2DEVCFG0       /* 0xBFC6FFCC */
  .extern BF2DEVCP3        /* 0xBFC6FFD0 */
  .extern BF2DEVCP2        /* 0xBFC6FFD4 */
  .extern BF2DEVCP1        /* 0xBFC6FFD8 */
  .extern BF2DEVCP0        /* 0xBFC6FFDC */
  .extern BF2DEVSIGN3      /* 0xBFC6FFE0 */
  .extern BF2DEVSIGN2      /* 0xBFC6FFE4 */
  .extern BF2DEVSIGN1      /* 0xBFC6FFE8 */
  .extern BF2DEVSIGN0      /* 0xBFC6FFEC */
  .extern BF2SEQ3          /* 0xBFC6FFF0 */
  .extern BF2SEQ2          /* 0xBFC6FFF4 */
  .extern BF2SEQ1          /* 0xBFC6FFF8 */
  .extern BF2SEQ0          /* 0xBFC6FFFC */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPN_POSITION                 0x00000007
#define _CFGCON_IOANCPN_MASK                     0x00000080
#define _CFGCON_IOANCPN_LENGTH                   0x00000001

#define _CFGCON_USBSSEN_POSITION                 0x00000008
#define _CFGCON_USBSSEN_MASK                     0x00000100
#define _CFGCON_USBSSEN_LENGTH                   0x00000001

