codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efk100.h
#define _ADCCON1_SIDL_POSITION                   0x0000000D
#define _ADCCON1_SIDL_MASK                       0x00002000
#define _ADCCON1_SIDL_LENGTH                     0x00000001

#define _ADCCON1_ON_POSITION                     0x0000000F
#define _ADCCON1_ON_MASK                         0x00008000
#define _ADCCON1_ON_LENGTH                       0x00000001

#define _ADCCON1_STRGSRC_POSITION                0x00000010
#define _ADCCON1_STRGSRC_MASK                    0x001F0000
#define _ADCCON1_STRGSRC_LENGTH                  0x00000005

#define _ADCCON1_SELRES_POSITION                 0x00000015
#define _ADCCON1_SELRES_MASK                     0x00600000
#define _ADCCON1_SELRES_LENGTH                   0x00000002

#define _ADCCON1_FRACT_POSITION                  0x00000017
#define _ADCCON1_FRACT_MASK                      0x00800000
#define _ADCCON1_FRACT_LENGTH                    0x00000001

#define _ADCCON1_TRBSLV_POSITION                 0x00000018
#define _ADCCON1_TRBSLV_MASK                     0x07000000
#define _ADCCON1_TRBSLV_LENGTH                   0x00000003

#define _ADCCON1_TRBMST_POSITION                 0x0000001B
#define _ADCCON1_TRBMST_MASK                     0x38000000
#define _ADCCON1_TRBMST_LENGTH                   0x00000003

#define _ADCCON1_TRBERR_POSITION                 0x0000001E
#define _ADCCON1_TRBERR_MASK                     0x40000000
#define _ADCCON1_TRBERR_LENGTH                   0x00000001

#define _ADCCON1_TRBEN_POSITION                  0x0000001F
#define _ADCCON1_TRBEN_MASK                      0x80000000
#define _ADCCON1_TRBEN_LENGTH                    0x00000001

#define _ADCCON2_ADCDIV_POSITION                 0x00000000
#define _ADCCON2_ADCDIV_MASK                     0x0000007F
#define _ADCCON2_ADCDIV_LENGTH                   0x00000007

#define _ADCCON2_ADCEIS_POSITION                 0x00000008
#define _ADCCON2_ADCEIS_MASK                     0x00000700
#define _ADCCON2_ADCEIS_LENGTH                   0x00000003

#define _ADCCON2_ADCEIOVR_POSITION               0x0000000C
#define _ADCCON2_ADCEIOVR_MASK                   0x00001000
#define _ADCCON2_ADCEIOVR_LENGTH                 0x00000001

#define _ADCCON2_EOSIEN_POSITION                 0x0000000D
#define _ADCCON2_EOSIEN_MASK                     0x00002000
#define _ADCCON2_EOSIEN_LENGTH                   0x00000001

#define _ADCCON2_REFFLTIEN_POSITION              0x0000000E
#define _ADCCON2_REFFLTIEN_MASK                  0x00004000
#define _ADCCON2_REFFLTIEN_LENGTH                0x00000001

#define _ADCCON2_BGVRIEN_POSITION                0x0000000F
#define _ADCCON2_BGVRIEN_MASK                    0x00008000
#define _ADCCON2_BGVRIEN_LENGTH                  0x00000001

#define _ADCCON2_SAMC_POSITION                   0x00000010
#define _ADCCON2_SAMC_MASK                       0x03FF0000
#define _ADCCON2_SAMC_LENGTH                     0x0000000A

#define _ADCCON2_CVDCPL_POSITION                 0x0000001A
#define _ADCCON2_CVDCPL_MASK                     0x1C000000
#define _ADCCON2_CVDCPL_LENGTH                   0x00000003

#define _ADCCON2_EOSRDY_POSITION                 0x0000001D
#define _ADCCON2_EOSRDY_MASK                     0x20000000
#define _ADCCON2_EOSRDY_LENGTH                   0x00000001

#define _ADCCON2_REFFLT_POSITION                 0x0000001E
#define _ADCCON2_REFFLT_MASK                     0x40000000
#define _ADCCON2_REFFLT_LENGTH                   0x00000001

#define _ADCCON2_BGVRRDY_POSITION                0x0000001F
#define _ADCCON2_BGVRRDY_MASK                    0x80000000
#define _ADCCON2_BGVRRDY_LENGTH                  0x00000001

#define _ADCCON3_ADINSEL_POSITION                0x00000000
#define _ADCCON3_ADINSEL_MASK                    0x0000003F
#define _ADCCON3_ADINSEL_LENGTH                  0x00000006

#define _ADCCON3_GSWTRG_POSITION                 0x00000006
#define _ADCCON3_GSWTRG_MASK                     0x00000040
#define _ADCCON3_GSWTRG_LENGTH                   0x00000001

#define _ADCCON3_GLSWTRG_POSITION                0x00000007
#define _ADCCON3_GLSWTRG_MASK                    0x00000080
#define _ADCCON3_GLSWTRG_LENGTH                  0x00000001

#define _ADCCON3_RQCNVRT_POSITION                0x00000008
#define _ADCCON3_RQCNVRT_MASK                    0x00000100
#define _ADCCON3_RQCNVRT_LENGTH                  0x00000001

#define _ADCCON3_SAMP_POSITION                   0x00000009
#define _ADCCON3_SAMP_MASK                       0x00000200
#define _ADCCON3_SAMP_LENGTH                     0x00000001

#define _ADCCON3_UPDRDY_POSITION                 0x0000000A
#define _ADCCON3_UPDRDY_MASK                     0x00000400
#define _ADCCON3_UPDRDY_LENGTH                   0x00000001

#define _ADCCON3_UPDIEN_POSITION                 0x0000000B
#define _ADCCON3_UPDIEN_MASK                     0x00000800
#define _ADCCON3_UPDIEN_LENGTH                   0x00000001

#define _ADCCON3_TRGSUSP_POSITION                0x0000000C
#define _ADCCON3_TRGSUSP_MASK                    0x00001000
#define _ADCCON3_TRGSUSP_LENGTH                  0x00000001

#define _ADCCON3_VREFSEL_POSITION                0x0000000D
#define _ADCCON3_VREFSEL_MASK                    0x0000E000
#define _ADCCON3_VREFSEL_LENGTH                  0x00000003

#define _ADCCON3_DIGEN0_POSITION                 0x00000010
#define _ADCCON3_DIGEN0_MASK                     0x00010000
#define _ADCCON3_DIGEN0_LENGTH                   0x00000001

#define _ADCCON3_DIGEN1_POSITION                 0x00000011
#define _ADCCON3_DIGEN1_MASK                     0x00020000
#define _ADCCON3_DIGEN1_LENGTH                   0x00000001

#define _ADCCON3_DIGEN2_POSITION                 0x00000012
#define _ADCCON3_DIGEN2_MASK                     0x00040000
#define _ADCCON3_DIGEN2_LENGTH                   0x00000001

#define _ADCCON3_DIGEN3_POSITION                 0x00000013
#define _ADCCON3_DIGEN3_MASK                     0x00080000
#define _ADCCON3_DIGEN3_LENGTH                   0x00000001

#define _ADCCON3_DIGEN4_POSITION                 0x00000014
#define _ADCCON3_DIGEN4_MASK                     0x00100000
#define _ADCCON3_DIGEN4_LENGTH                   0x00000001

#define _ADCCON3_DIGEN7_POSITION                 0x00000017
#define _ADCCON3_DIGEN7_MASK                     0x00800000
#define _ADCCON3_DIGEN7_LENGTH                   0x00000001

